src/cfe/КСП/InformationRegisters/КСП_ОчередьОбменаСЧестнымЗнаком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_ОчередьОбменаСЧестнымЗнаком</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСостоянияHTTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГУИДвЧестномЗнаке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВЧестномЗнаке</Name>
					<Comment>Поле status в ответном json-e</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныйJson</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДвиженияКМ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДвиженияКМФулфилмент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МоментВремениМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/КСП_ОчередьОбменаСЧестнымЗнаком/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьНовыйДокумент(ДокСсылка) Экспорт
	
	НЗ = РегистрыСведений.КСП_ОчередьОбменаСЧестнымЗнаком.СоздатьНаборЗаписей();
	НЗ.Отбор.ДвиженияКМ.Установить(ДокСсылка);
	
	МоментВремениМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	НЗ.Отбор.МоментВремениМС.Установить(МоментВремениМС);
	
	НовСтр = НЗ.Добавить();
	НовСтр.ДвиженияКМ = ДокСсылка;
	НовСтр.МоментВремениМС = МоментВремениМС;
	НовСтр.ДатаВремяСобытия = ТекущаяДатаСеанса();
	НовСтр.Операция = "Новый";
	НовСтр.Состояние = "Новый";
	
	НЗ.Записать();
		
КонецПроцедуры


// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ГУИДДокумента(ДвиженияКМСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.ГУИДвЧестномЗнаке КАК ГУИДвЧестномЗнаке
		|ИЗ
		|	РегистрСведений.КСП_ОчередьОбменаСЧестнымЗнаком КАК Рег
		|ГДЕ
		|	Рег.ДвиженияКМ = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рег.МоментВремениМС УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка", ДвиженияКМСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ГУИДвЧестномЗнаке) Тогда
			Возврат Выборка.ГУИДвЧестномЗнаке;
		КонецЕсли;
    КонецЦикла;
		
	Возврат "";
	
КонецФункции
